dp[0][0] = 0; //Edge Case, 兩個空字串不需要操作
for(int i = 1; i <= n; ++i) dp[i][0] = i; //如果一個字串為空 則最小成本就是刪掉另一個字串
for(int j = 1; j <= m; ++j) dp[0][j] = j; 
 
//老套的從小大到轉移
for(int i = 1; i <= n; ++i) 
    for(int j = 1; j <= m; ++j){ 
    if(s[i] == t[j]) dp[i][j] = dp[i-1][j-1]; //結尾相同，所以不用花成本
    dp[i][j] = min({
        dp[i][j],
        dp[i-1][j] + 1,   //刪除 s[i] 花費成本 1
        dp[i][j-1] + 1,   //刪除 t[j] 花費成本 1
        //dp[i-1][j] + 1,   //插入一個字元在 t[j] 後和 s[i] 配對 花費成本 1
        //dp[i][j-1] + 1,   //插入一個字元在 s[i] 後和 t[j] 配對 花費成本 1
        dp[i-1][j-1] + 1 //替換 t[i] 換成跟 s[j] 一樣的 花費成本 1
    });
}
cout << dp[n][m];